// let num = prompt("숫자 범위를 입력하세요");
// num = Number(num);

// for (let i = 1; i <= num; i++){
//     // i % 13 === 0 => 13의 배수
//     // i % 2 === 1 => 홀수
//     if(i % 13 === 0 && i % 2 === 1){
//         console.log(i);
//     }
// }


// =======================================================
// // 구구단
// for (let i = 1; i < 10; i++) {
//     console.log(`=== ${i}단===`);
//     for (let j = 1; j < 10; j++) {   
//     console.log(`${i} X ${j} = ${i * j}`);
//     }
// }


//=========================================================
let i = 0; // for문에서 i 역할(반복 횟수)
let sum = 0; // 합

while (i <= 100) {
  if (i % 2 === 0 || i % 5 === 0) {
    sum += i;
  }
  i++;
}

console.log(sum);